Revit 2027 API
LightFamily Methods
The LightFamily type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLightDistributionStyle |  Returns a LightDistributionStyle value for the light distribution
GetLightFamily |  Creates a light family object from the given family document
GetLightShapeStyle |  Returns a LightShapeStyle value for the light shape
GetLightSourceTransform |  Returns a Transform value for the transform of light source.
GetLightType |  Return a LightType object for the light type at the given index
GetLightTypeName |  Return the name for the light type at the given index
GetNumberOfLightTypes |  Return the number of light types contained in this light family
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetLightDistributionStyle |  Set the light distribution style to the given shape distribution
SetLightShapeStyle |  Set the light shape style to the given shape style
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace